my_dict = {'Артем' : 2003, 'Полина' : 2004, 'Игорь' : 1999}
print('Весь словарь:', my_dict)
print( 'Значение по ключю "Артем":',my_dict['Артем'])
print('Значение по ключю "Алексей":', my_dict.get('Алексей', 'такого ключа нет'))
print('Значение "', my_dict.pop('Полина'), '" по ключю "Полина" извлечено из словаря.')
my_dict.update({'Саша': 1980, 'Паша': 2002})
print('Обновленный словарь:', my_dict)


my_set = { 1, 2, 1, 3, 4, 5, 5, 4, 3, 'string', 'name', 'name', True, (2, 4, 6, 8)}
print('Все множество:', my_set)
my_set.discard('string')
my_set.add(6)
my_set.add(7)
my_set.add('age')
print('Все множество с новыми элементами:', my_set)